# TrueLoad Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaBasedLoadData..::..TrueLoad Property
AreaBasedLoadData Class See Also
---
The electrical true load of the area based load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public double TrueLoad { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TrueLoad As Double
	Get
```

Visual C++
---
```text
public:
property double TrueLoad {
	double get ();
}
```

# See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace